# оператор присваивания
#   левый операнд: всегда является переменной или объектом,
#                  в который необходимо осуществить присваивание
#   правый операнд: вычисляемое выражение, результат которого присваивается  
#                   объекту в левом операнде
a = 45

# унарный опреатор отрицательного числа
-1
# бинарный оператор математического сложения
1 + 1
# бинарный оператор вычитания
1 - 1
# оператор умножения
1 * 1
# оператор возведения в степень
1 ** 1
# оператор вещественного деления
1 / 1
# оператор целочисленного деления
1 // 1
# оператор взятия остатка от деления
1 % 1

# тернарный условный оператор: 
#   возвращает левый операнд, если первый (центральный) операнд возвращает True
#   возвращает правый операнд, если первый (центральный) операнд возвращает False
1 if a > 0 else 0
